_posts/2016-05-15-perf-events.org
# +TITLE: perf-events
# +DATE: 2016-05-15
# +AUTHOR:    Manoj Raja Rao
# +EMAIL:     manoj@manojrao.com
#+DESCRIPTION: Overview of the perf profiler tool
#+KEYWORDS: perf, linux, function graph, tracing, latency, profiler
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 
#+JEKYLL_TAGS: 
#+JEKYLL_PUBLISHED: true


* Introduction
** perf - What is perf?
- The generic profiler tool for linux
- Provides a rich set of tools that abstracts away CPU hardware differences
- Is available in all modern linux systems


** perf - allows you to trace, collect and analyze data
    :PROPERTIES:
    :BEAMER_env: column
    :END:      
    - perf is available in linux-tools-common package
    - perf supports a rich set of commands. Just type 'perf'..
    #+BEGIN_EXAMPLE
    annotate        Read perf.data (created by perf record) and display annotated code
    list            List all symbolic event types
    record          Run a command and record its profile into perf.data
    report          Read perf.data (created by perf record) and display the profile
    sched           Tool to trace/measure scheduler properties (latencies)
    script          Read perf.data (created by perf record) and display trace output
    stat            Run a command and gather performance counter statistics
    timechart       Tool to visualize total system behavior during a workload
    top             System profiling tool.
    #+END_EXAMPLE
** perf - Sample usage
    - In it's simplest form:
    #+BEGIN_EXAMPLE 
    # perf record -a -g -F 99 --
    #+END_EXAMPLE
    - This records the activity in the system by:
      - -F sampling at a sampling frequency of 99Hz
      - -a profiling all cores
      - -g generating call graph info
    - Now for generating human readable output from the collected traces
    #+BEGIN_EXAMPLE 
    # perf report 
    #+END_EXAMPLE
    - This displays the performance counter profile info recorded
      earlier
** perf report
#+BEGIN_EXAMPLE
+  27.12%           chrome  chrome                      [.] 0x00000000029633cb                                                                                            
+   5.18%           chrome  [kernel.kallsyms]           [k] trace_graph_entry                                                                                             
+   2.67%           chrome  perf-21360.map              [.] 0x000018b2828b9a40                                                                                            
+   2.54%     byobu-status  [kernel.kallsyms]           [k] trace_graph_entry                                                                                             
+   2.38%          swapper  [kernel.kallsyms]           [k] intel_idle                                                                                                    
+   1.86%          swapper  [kernel.kallsyms]           [k] trace_graph_entry                                                                                             
+   1.45%             Xorg  [kernel.kallsyms]           [k] trace_graph_entry                                                                                             
+   1.42%        vpnagentd  [kernel.kallsyms]           [k] trace_graph_entry                                                                                             
+   1.38%           chrome  [kernel.kallsyms]           [k] prepare_ftrace_return                                                                                         
+   1.38%               sh  [kernel.kallsyms]           [k] trace_graph_entry     
#+END_EXAMPLE

** Output of perf report -n --stdio
*perf report -n --stdio*
#+ATTR_LATEX: width:\textwidth
#+BEGIN_EXAMPLE
# Samples: 556  of event 'cycles'
# Event count (approx.): 6711822878
#
# Overhead   Samples      Command      Shared Object                                                                                                     
# ........  ............  ..........  ..................
#
    27.12%   115   chrome  chrome [.] 0x00000000029633cb                                                                             
              |
              |
...
    5.18%     22   chrome  [kernel.kallsyms] [k] trace_graph_entry                                                                              
              |
              --- trace_graph_entry
                         prepare_ftrace_return
                         ftrace_graph_caller
                        |
                        |
...
    2.54%     12     byobu-status  [kernel.kallsyms] [k] trace_graph_entry                                                                              
               |
               --- trace_graph_entry
                  |
                  |
#+END_EXAMPLE
